Reports/МедицинскийОтчет016у.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>МедицинскийОтчет016у</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДанныеМедицинскихОтчетов007у.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеМедицинскихОтчетов007у</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧислоКоек</Name>
					<Comment>Колонка2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоНедоступныхКоек</Name>
					<Comment>Колонка3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаНачалоПериода</Name>
					<Comment>Колонка4</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступило</Name>
					<Comment>Колонка5</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоИзДневногоСтационара</Name>
					<Comment>Колонка6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоСельскихЖителей</Name>
					<Comment>Колонка7</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоНесовершеннолетних</Name>
					<Comment>Колонка8</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилоСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка9</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноИзДругихОтделений</Name>
					<Comment>Колонка10</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноВДругиеОтделения</Name>
					<Comment>Колонка11</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписано</Name>
					<Comment>Колонка12</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка13</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноВДневнойСтационар</Name>
					<Comment>Колонка14</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыписаноВКруглосуточныйСтационар</Name>
					<Comment>Колонка15</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Умерло</Name>
					<Comment>Колонка16</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УмерлоНесовершеннолетних</Name>
					<Comment>Колонка17</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УмерлоСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка18</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаКонецПериода</Name>
					<Comment>Колонка19</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста</Name>
					<Comment>Колонка20</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаконныхПредставителейНаКонецПериода</Name>
					<Comment>Колонка21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныхМестМужских</Name>
					<Comment>Колонка22</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныхМестЖенских</Name>
					<Comment>Колонка23</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Comment>Колонка1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтационара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Круглосуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КлассификаторыМинЗдрава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторыМинЗдрава</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/МедицинскийОтчет016у/Ext/ObjectModule.bsl
#Область РазделОписанияПеременных
Перем мВерсияОтчета Экспорт;// Строка, версия отчета
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Таблица форм отчета
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица форм отчета.
//
Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета";
	НоваяФорма.ОписаниеОтчета     = "";
	НоваяФорма.РедакцияФормы      = "";
	НоваяФорма.ДатаНачалоДействия = '20010101';
	НоваяФорма.ДатаКонецДействия  = МедицинскаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
			
	Возврат ТаблицаФормОтчета;
	
КонецФункции

// Периодичность отчета.
//
// Параметры:
//  ПараметрыОтчета	 - Неопределено - не используется.
// 
// Возвращаемое значение:
//  Строка - периодичность Год, Полугодие, Квартал, Месяц, День.
//
Функция ПериодичностьОтчета(ПараметрыОтчета = Неопределено) Экспорт
	
	Возврат "Год,Полугодие,Месяц"; // "Год,Полугодие,Квартал,Месяц,День".
	
КонецФункции

// Структура страниц отчета.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  мДеревоСтраницОтчета - ДанныеФормыДерево - дерево страниц отчета
//
Процедура ФормироватьСтруктуруСтраницОтчета(ВыбраннаяФорма, мДеревоСтраницОтчета) Экспорт
	
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
КонецПроцедуры

// Установить доступность областей.
//
// Параметры:
//  ВыбраннаяФорма		 - ФормаКлиентскогоПриложения - форма
//  Форма				 - ФормаКлиентскогоПриложения - форма 
//  ИмяСтраницыПанели	 - Строка - имя страницы панели.
//
Процедура УстановитьДоступностьОбластей(ВыбраннаяФорма, Форма, ИмяСтраницыПанели = "") Экспорт
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	
	ЗапрещенныеОбласти = Новый Массив;
	ЗапрещенныеОбласти.Добавить("Подпись");
	ЗапрещенныеОбласти.Добавить("Шапка");
	ЗапрещенныеОбласти.Добавить("ОтчетГод");
	ЗапрещенныеОбласти.Добавить("Дата");
	ЗапрещенныеОбласти.Добавить("ОтчетныйПериод");
	
	ОбластиРучноеРедактирование = Новый Массив;
	ОбластиРучноеРедактирование.Добавить("ФИОПодпись");
	ОбластиРучноеРедактирование.Добавить("КодОКУД");
	ОбластиРучноеРедактирование.Добавить("Подразделение");
	
	Для Каждого Область Из ТабДокумент.Области Цикл
		Если ЗапрещенныеОбласти.Найти(Область.Имя) = Неопределено И ОбластиРучноеРедактирование.Найти(Область.Имя) = Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_4"], Область);
		ИначеЕсли ОбластиРучноеРедактирование.Найти(Область.Имя) <>  Неопределено Тогда
			МедицинскаяОтчетностьВызовСервера.РазрешитьВводДанныхВОбласть(Форма.мСтруктураЦветовРаскраски["_0"], Область);	
		КонецЕсли; 		
	КонецЦикла;
		
	мНомераКолонокСтрокой = Новый Массив;
	мНомераКолонокСтрокой.Добавить("001");
	
	ЗапретРедактированияДляКолонокДинамическойТаблицы(Форма, "Титульный", ИмяСтраницыПанели, "СтрокаТаблицы", мНомераКолонокСтрокой);
	
КонецПроцедуры

Процедура ЗапретРедактированияДляКолонокДинамическойТаблицы(Форма, ИмяСтраницы, ИмяСтраницыПанели, ИмяОбластиСтроки, мНомераКолонокСтрокой = Неопределено)
	
	ТабДокумент = Форма.ПолеТабличногоДокументаФормаОтчета;
	Если ИмяСтраницыПанели = ИмяСтраницы Тогда
		Для Каждого Область Из ТабДокумент.Области Цикл	
			Если СтрНайти(Область.Имя, ИмяОбластиСтроки) <> 0 Тогда
				Если мНомераКолонокСтрокой <> Неопределено
					И СтрНайти(Область.Имя, "Шапка") = 0 
				Тогда
					ПозицияРазделителяДинамТаблицы = СтрНайти(Область.Имя, "__");
					НомерКолонки = Лев(Прав(Область.Имя, СтрДлина(Область.Имя) - ПозицияРазделителяДинамТаблицы - 1), 3);
					Если мНомераКолонокСтрокой.Найти(НомерКолонки) <> Неопределено Тогда
						Область.Защита = Истина;
						Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];
					Иначе
						Область.Защита = Ложь;
						Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_4"];		
					КонецЕсли;		
				Иначе
					Область.Защита = Истина;
					Область.ЦветФона = Форма.мСтруктураЦветовРаскраски["_5"];	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовокФормы() Экспорт
	
	Возврат "Форма 016/у. Сводная ведомость  учета движения пациентов и коечного фонда медицинской организации";	
	
КонецФункции

#Область АлгоритмЗаполнения

// Заполнить отчет.
//
// Параметры:
//  ВыбраннаяФорма			 - ФормаКлиентскогоПриложения	 - форма
//  ПараметрыОтчета			 - Структура					 - параметры отчета
//  ЭтаФорма				 - ФормаКлиентскогоПриложения	 - форма
//  СтруктураРеквизитовФормы - Структура					 - структура реквизитов формы.
//
Процедура ЗаполнитьОтчет(ВыбраннаяФорма, ПараметрыОтчета, ЭтаФорма, СтруктураРеквизитовФормы) Экспорт 
	
	Подразделение = ЭтаФорма.ПолеТабличногоДокументаФормаОтчета.Область("Подразделение").Значение;
	
	Контейнер = Новый Структура();
	 
	Контейнер.Вставить("МногострочныеДанные");
	Контейнер.Вставить("Дата");
	Контейнер.Вставить("НаименованиеАдресЛПУ");	
	Контейнер.Вставить("ОтчетныйПериод");
	
	РазницаПоМесяцам = Месяц(ПараметрыОтчета.мДатаКонцаПериодаОтчета) - Месяц(ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	Если РазницаПоМесяцам = 0 Тогда
		ОтчетныйПериод = "Месяц";
		Дата = Формат(ПараметрыОтчета.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг ''г. '''");
	ИначеЕсли РазницаПоМесяцам = 11 Тогда
		ОтчетныйПериод = "Год";
		Дата = Формат(ПараметрыОтчета.мДатаКонцаПериодаОтчета, "ДФ='гггг ''г. '''");
	Иначе
		ОтчетныйПериод = "Полугодие";
		Дата = ?(НачалоГода(ПараметрыОтчета.мДатаНачалаПериодаОтчета) = ПараметрыОтчета.мДатаНачалаПериодаОтчета, "I полугодие", "II полугодие");
		Дата = Дата + Формат(ПараметрыОтчета.мДатаКонцаПериодаОтчета, "ДФ=' гггг ''г. '''");
	КонецЕсли;
	
	Контейнер.МногострочныеДанные = ПолучитьТаблицуМногострочныеДанные(ПараметрыОтчета.мДатаНачалаПериодаОтчета,ПараметрыОтчета.мДатаКонцаПериодаОтчета,Подразделение,ОтчетныйПериод);
	Контейнер.НаименованиеАдресЛПУ = ПараметрыОтчета.Филиал.НазваниеОрганизации + " " + КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ПараметрыОтчета.Филиал, Перечисления.ТипыКонтактнойИнформации.Адрес);	
	Контейнер.Дата = Дата;
	Контейнер.ОтчетныйПериод = ОтчетныйПериод;
	
	ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, "Титульный", Контейнер.МногострочныеДанные, "СтрокаТаблицы",,Истина);
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("НаименованиеАдресЛПУ",Контейнер.НаименованиеАдресЛПУ);
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("ОтчетныйПериод",Контейнер.ОтчетныйПериод);
	ЭтаФорма["СтруктураДанныхСтраниц"]["Титульный"].Вставить("Дата",Контейнер.Дата);
	
КонецПроцедуры

Функция ПолучитьТаблицуМногострочныеДанные(НачалоПериода, КонецПериода, Подразделение, ОтчетныйПериод)
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	
	ТаблицаДанных.Колонки.Добавить("Колонка1");
	
	Для Счетчик = 2 По 24 Цикл
		ТаблицаДанных.Колонки.Добавить("Колонка" + Строка(Счетчик), Новый ОписаниеТипов("Число"));
	КонецЦикла;
		
	НачалоПериода = НачалоМесяца(НачалоПериода);
	КонецПериода = КонецМесяца(КонецПериода);
	
	ДокументыЗаПериод = ПолучитьДокументы007(Подразделение, НачалоПериода, КонецПериода);
	ЗаполнитьКолонки(ТаблицаДанных,ДокументыЗаПериод, Подразделение, НачалоПериода, КонецПериода);
	
	Даты = Неопределено;
	Если Не ЕстьДокументыНаКаждуюДатуПериода(Даты, Подразделение, НачалоПериода, КонецПериода) Тогда
		МассивДат = ПолучитьОтсутствующиеДаты(Даты, НачалоПериода, КонецПериода);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОтстутствующихДанных(МассивДат));
	КонецЕсли;
			
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ВнестиМногоСтрочнуюДинамичнуюТаблицу(ЭтаФорма, ИмяРаздела, Таблица, ИмяОбластиСтрок, ВыводитьПустыеСтроки = Ложь, ОчищатьТаблицу = Ложь)
	
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	МаксКол = Таблица.Колонки.Количество();	
	
	Если ОчищатьТаблицу Тогда
		Для Каждого КлючИЗначение Из СтруктураДанных Цикл
			Если СтрНайти(КлючИЗначение.Ключ, ИмяОбластиСтрок + "__") Тогда
				СтруктураДанных.Удалить(КлючИЗначение.Ключ);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Стр = 1;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = 0 По МаксКол - 1 Цикл
			ИмяЯчейки = ИмяОбластиСтрок + "__" + Формат(Сч + 1, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);	
			Значение = СтрокаТаблицы[Сч]; 
			Если ЗначениеЗаполнено(Значение) Или ВыводитьПустыеСтроки Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти

#Область Расшифровка

// Установить параметры расшифровки.
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма
//  ПараметрыОтчета	 - Структура - параметры отчета 
//  ИмяЯчейки		 - Строка - имя ячейки
// 
// Возвращаемое значение:
//  Структура - параметры расшифровки.
//
Функция УстановитьПараметрыРасшифровки(ВыбраннаяФорма, ПараметрыОтчета, ИмяЯчейки) Экспорт
 
	Возврат Неопределено;
		
КонецФункции

#КонецОбласти

Процедура ВнестиТаблицуВТабДокумент(ЭтаФорма, СтруктураРеквизитовФормы, ИмяРаздела, Таблица, КолонкаСтарт = 0, СтруктураДанныхИсходная = Неопределено)

	Если Таблица = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	ТабДокумент = ЭтаФорма.ПолеТабличногоДокументаФормаОтчета;
	МаксКол = Таблица.Колонки.Количество();
	Стр = 1;
	СтруктураДанных = ЭтаФорма["СтруктураДанныхСтраниц"][ИмяРаздела];
	ЗаноситьВчейки = СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для Сч = КолонкаСтарт По МаксКол - 1 Цикл
			ИмяЯчейки = "П010000101" + Формат(Сч + 1 - КолонкаСтарт, "ЧЦ=3; ЧВН=") + "_" + Строка(Стр);
			Значение = СтрокаТаблицы[Сч];
			Если ЗаноситьВчейки Тогда
				ТабДокумент.Области[ИмяЯчейки].Значение = Значение;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(Значение) Тогда
				СтруктураДанных.Вставить(ИмяЯчейки,Значение);
			ИначеЕсли СтруктураДанных.Свойство(ИмяЯчейки) Тогда 
				СтруктураДанных.Удалить(ИмяЯчейки);	
			КонецЕсли;
		КонецЦикла;
		Стр = Стр + 1;
	КонецЦикла; 
	
КонецПроцедуры
 
// Получить список разделов для загрузки
//
// Параметры:
//  ВыбраннаяФорма	 - ФормаКлиентскогоПриложения - форма 
// 
// Возвращаемое значение:
//  Массив -  разделы для загрузки.
//
Функция ПолучитьСписокРазделовДляЗагрузки(ВыбраннаяФорма) Экспорт
	
	СписокРазделовДляЗагрузки = Новый Массив;
	СписокРазделовДляЗагрузки.Добавить("Титульный");
	СписокРазделовДляЗагрузки.Добавить("Оборот");

	Возврат СписокРазделовДляЗагрузки;
	
КонецФункции

#Область ЗаполнениеДанныхТаблиц

Функция ПолучитьДокументы007(Подразделение, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеМедицинскихОтчетов007у.Период КАК Период,
	               |	ДанныеМедицинскихОтчетов007у.Регистратор КАК Регистратор,
	               |	ДанныеМедицинскихОтчетов007у.Подразделение КАК Подразделение,
	               |	ДанныеМедицинскихОтчетов007у.Подразделение.ВидСтационара КАК ВидСтационара,
	               |	ДанныеМедицинскихОтчетов007у.Профиль КАК Профиль,
	               |	ДанныеМедицинскихОтчетов007у.ЧислоКоек КАК ЧислоКоек,
	               |	ДанныеМедицинскихОтчетов007у.ЧислоНедоступныхКоек КАК ЧислоНедоступныхКоек,
	               |	ДанныеМедицинскихОтчетов007у.КлиентовНаНачалоПериода КАК КлиентовНаНачалоПериода,
	               |	ДанныеМедицинскихОтчетов007у.Поступило КАК Поступило,
	               |	ДанныеМедицинскихОтчетов007у.ПоступилоИзДневногоСтационара КАК ПоступилоИзДневногоСтационара,
	               |	ДанныеМедицинскихОтчетов007у.ПоступилоСельскихЖителей КАК ПоступилоСельскихЖителей,
	               |	ДанныеМедицинскихОтчетов007у.ПоступилоНесовершеннолетних КАК ПоступилоНесовершеннолетних,
	               |	ДанныеМедицинскихОтчетов007у.ПоступилоСтаршеТрудоспособногоВозраста КАК ПоступилоСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.ПереведеноИзДругихОтделений КАК ПереведеноИзДругихОтделений,
	               |	ДанныеМедицинскихОтчетов007у.ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста КАК ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.ПереведеноВДругиеОтделения КАК ПереведеноВДругиеОтделения,
	               |	ДанныеМедицинскихОтчетов007у.ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста КАК ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.Выписано КАК Выписано,
	               |	ДанныеМедицинскихОтчетов007у.ВыписаноСтаршеТрудоспособногоВозраста КАК ВыписаноСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.ВыписаноВДневнойСтационар КАК ВыписаноВДневнойСтационар,
	               |	ДанныеМедицинскихОтчетов007у.ВыписаноВКруглосуточныйСтационар КАК ВыписаноВКруглосуточныйСтационар,
	               |	ДанныеМедицинскихОтчетов007у.Умерло КАК Умерло,
	               |	ДанныеМедицинскихОтчетов007у.УмерлоНесовершеннолетних КАК УмерлоНесовершеннолетних,
	               |	ДанныеМедицинскихОтчетов007у.УмерлоСтаршеТрудоспособногоВозраста КАК УмерлоСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.КлиентовНаКонецПериода КАК КлиентовНаКонецПериода,
	               |	ДанныеМедицинскихОтчетов007у.КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста КАК КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста,
	               |	ДанныеМедицинскихОтчетов007у.ЗаконныхПредставителейНаКонецПериода КАК ЗаконныхПредставителейНаКонецПериода,
	               |	ДанныеМедицинскихОтчетов007у.СвободныхМестМужских КАК СвободныхМестМужских,
	               |	ДанныеМедицинскихОтчетов007у.СвободныхМестЖенских КАК СвободныхМестЖенских
	               |ПОМЕСТИТЬ ДанныеОтчетов
	               |ИЗ
	               |	РегистрСведений.ДанныеМедицинскихОтчетов007у КАК ДанныеМедицинскихОтчетов007у
	               |ГДЕ
	               |	ДанныеМедицинскихОтчетов007у.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ДанныеМедицинскихОтчетов007у.Подразделение = &Подразделение
	               |	И ДанныеМедицинскихОтчетов007у.Профиль <> ЗНАЧЕНИЕ(Справочник.КлассификаторыМинЗдрава.ПустаяСсылка)
	               |	И ДанныеМедицинскихОтчетов007у.Активность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеОтчетов.Профиль КАК Профиль,
	               |	МАКСИМУМ(ДанныеОтчетов.Период) КАК Период
	               |ПОМЕСТИТЬ ПоследниеДаты
	               |ИЗ
	               |	ДанныеОтчетов КАК ДанныеОтчетов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеОтчетов.Профиль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеДаты.Профиль КАК Профиль,
	               |	ДанныеОтчетов.ЧислоКоек КАК ЧислоКоекНаКоенцПериода,
	               |	ДанныеОтчетов.ЧислоНедоступныхКоек КАК ЧислоНедоступныхКоекНаКонецПериода,
	               |	ДанныеОтчетов.КлиентовНаКонецПериода КАК КлиентовНаКонецПериодаВКонцеПериода
	               |ПОМЕСТИТЬ ДанныеПоследнихОтчетов
	               |ИЗ
	               |	ПоследниеДаты КАК ПоследниеДаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОтчетов КАК ДанныеОтчетов
	               |		ПО ПоследниеДаты.Профиль = ДанныеОтчетов.Профиль
	               |			И ПоследниеДаты.Период = ДанныеОтчетов.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеОтчетов.Профиль КАК Профиль,
	               |	МИНИМУМ(ДанныеОтчетов.Период) КАК Период
	               |ПОМЕСТИТЬ ПервыеДаты
	               |ИЗ
	               |	ДанныеОтчетов КАК ДанныеОтчетов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеОтчетов.Профиль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПервыеДаты.Профиль КАК Профиль,
	               |	ДанныеОтчетов.КлиентовНаНачалоПериода КАК КлиентовНаНачалоПериодаВНачалеПериода
	               |ПОМЕСТИТЬ ДанныеПервыхОтчетов
	               |ИЗ
	               |	ПервыеДаты КАК ПервыеДаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОтчетов КАК ДанныеОтчетов
	               |		ПО ПервыеДаты.Профиль = ДанныеОтчетов.Профиль
	               |			И ПервыеДаты.Период = ДанныеОтчетов.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеОтчетов.Профиль КАК Профиль,
	               |	ДанныеПервыхОтчетов.КлиентовНаНачалоПериодаВНачалеПериода КАК КлиентовНаНачалоПериодаВНачалеПериода,
	               |	ДанныеПоследнихОтчетов.ЧислоКоекНаКоенцПериода КАК ЧислоКоекНаКонецПериода,
	               |	ДанныеПоследнихОтчетов.ЧислоНедоступныхКоекНаКонецПериода КАК ЧислоНедоступныхКоекНаКонецПериода,
	               |	ДанныеПоследнихОтчетов.КлиентовНаКонецПериодаВКонцеПериода КАК КлиентовНаКонецПериодаВКонцеПериода,
	               |	СУММА(ДанныеОтчетов.ЧислоКоек) / (РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) + 1) КАК КоекВСреднемЗаПериод,
	               |	СУММА(ДанныеОтчетов.Поступило) КАК Поступило,
	               |	СУММА(ДанныеОтчетов.ПоступилоИзДневногоСтационара) КАК ПоступилоИзДневногоСтационара,
	               |	СУММА(ДанныеОтчетов.ПоступилоСельскихЖителей) КАК ПоступилоСельскихЖителей,
	               |	СУММА(ДанныеОтчетов.ПоступилоНесовершеннолетних) КАК ПоступилоНесовершеннолетних,
	               |	СУММА(ДанныеОтчетов.ПоступилоСтаршеТрудоспособногоВозраста) КАК ПоступилоСтаршеТрудоспособногоВозраста,
	               |	СУММА(ДанныеОтчетов.ПереведеноИзДругихОтделений) КАК ПереведеноИзДругихОтделений,
	               |	СУММА(ДанныеОтчетов.ПереведеноВДругиеОтделения) КАК ПереведеноВДругиеОтделения,
	               |	СУММА(ДанныеОтчетов.Выписано) КАК Выписано,
	               |	СУММА(ДанныеОтчетов.ВыписаноСтаршеТрудоспособногоВозраста) КАК ВыписаноСтаршеТрудоспособногоВозраста,
	               |	СУММА(ДанныеОтчетов.ВыписаноВДневнойСтационар) КАК ВыписаноВДневнойСтационар,
	               |	СУММА(ДанныеОтчетов.ВыписаноВКруглосуточныйСтационар) КАК ВыписаноВКруглосуточныйСтационар,
	               |	СУММА(ДанныеОтчетов.Умерло) КАК Умерло,
	               |	СУММА(ДанныеОтчетов.УмерлоНесовершеннолетних) КАК УмерлоНесовершеннолетних,
	               |	СУММА(ДанныеОтчетов.УмерлоСтаршеТрудоспособногоВозраста) КАК УмерлоСтаршеТрудоспособногоВозраста,
	               |	СУММА(ДанныеОтчетов.ЧислоНедоступныхКоек) КАК ЧислоНедоступныхКоек,
	               |	СУММА(ДанныеОтчетов.ЗаконныхПредставителейНаКонецПериода) КАК ЗаконныхПредставителейНаКонецПериода,
	               |	СУММА(ДанныеОтчетов.КлиентовНаКонецПериода + ВЫБОР
	               |			КОГДА ДанныеОтчетов.ВидСтационара = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.Круглосуточный)
	               |				ТОГДА 0.5 * (-ДанныеОтчетов.Поступило - ДанныеОтчетов.ПереведеноИзДругихОтделений + ДанныеОтчетов.ПереведеноВДругиеОтделения + ДанныеОтчетов.Выписано + ДанныеОтчетов.Умерло)
	               |			ИНАЧЕ ДанныеОтчетов.ПереведеноВДругиеОтделения + ДанныеОтчетов.Выписано + ДанныеОтчетов.Умерло
	               |		КОНЕЦ) КАК КойкоДней,
	               |	СУММА(ДанныеОтчетов.КлиентовНаКонецПериодаСтаршеТрудоспособногоВозраста + ВЫБОР
	               |			КОГДА ДанныеОтчетов.ВидСтационара = ЗНАЧЕНИЕ(Перечисление.ВидыСтационара.Круглосуточный)
	               |				ТОГДА 0.5 * (-ДанныеОтчетов.ПоступилоСтаршеТрудоспособногоВозраста - ДанныеОтчетов.ПереведеноИзДругихОтделенийСтаршеТрудоспособногоВозраста + ДанныеОтчетов.ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста + ДанныеОтчетов.ВыписаноСтаршеТрудоспособногоВозраста + ДанныеОтчетов.УмерлоСтаршеТрудоспособногоВозраста)
	               |			ИНАЧЕ ДанныеОтчетов.ПереведеноВДругиеОтделенияСтаршеТрудоспособногоВозраста + ДанныеОтчетов.ВыписаноСтаршеТрудоспособногоВозраста + ДанныеОтчетов.УмерлоСтаршеТрудоспособногоВозраста
	               |		КОНЕЦ) КАК КойкоДнейСтаршеТрудоспособногоВозраста
	               |ИЗ
	               |	ДанныеОтчетов КАК ДанныеОтчетов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнихОтчетов КАК ДанныеПоследнихОтчетов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПервыхОтчетов КАК ДанныеПервыхОтчетов
	               |			ПО ДанныеПоследнихОтчетов.Профиль = ДанныеПервыхОтчетов.Профиль
	               |		ПО ДанныеОтчетов.Профиль = ДанныеПоследнихОтчетов.Профиль
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеОтчетов.Профиль,
	               |	ДанныеПервыхОтчетов.КлиентовНаНачалоПериодаВНачалеПериода,
	               |	ДанныеПоследнихОтчетов.ЧислоКоекНаКоенцПериода,
	               |	ДанныеПоследнихОтчетов.ЧислоНедоступныхКоекНаКонецПериода,
	               |	ДанныеПоследнихОтчетов.КлиентовНаКонецПериодаВКонцеПериода";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ЗаполнитьКолонки(ТаблицаДанных, ДокументыЗаПериод, Подразделение, НачалоПериода, КонецПериода)
	
	Пока ДокументыЗаПериод.Следующий() Цикл
		
		СтрокаПрофиля = ТаблицаДанных.Добавить();
		СтрокаПрофиля.Колонка1 = ДокументыЗаПериод.Профиль;
		СтрокаПрофиля.Колонка5 = ДокументыЗаПериод.КлиентовНаНачалоПериодаВНачалеПериода;	
		
		СтрокаПрофиля.Колонка2 	= ДокументыЗаПериод.ЧислоКоекНаКонецПериода;
		СтрокаПрофиля.Колонка3 	= ДокументыЗаПериод.ЧислоНедоступныхКоекНаКонецПериода;
		СтрокаПрофиля.Колонка20 = ДокументыЗаПериод.КлиентовНаКонецПериодаВКонцеПериода;

		СтрокаПрофиля.Колонка4 	= ДокументыЗаПериод.КоекВСреднемЗаПериод;
		СтрокаПрофиля.Колонка6 	= ДокументыЗаПериод.Поступило;
		СтрокаПрофиля.Колонка7 	= ДокументыЗаПериод.ПоступилоИзДневногоСтационара;
		СтрокаПрофиля.Колонка8 	= ДокументыЗаПериод.ПоступилоСельскихЖителей;
		СтрокаПрофиля.Колонка9 	= ДокументыЗаПериод.ПоступилоНесовершеннолетних;
		СтрокаПрофиля.Колонка10	= ДокументыЗаПериод.ПоступилоСтаршеТрудоспособногоВозраста;
		СтрокаПрофиля.Колонка11 = ДокументыЗаПериод.ПереведеноИзДругихОтделений;
		СтрокаПрофиля.Колонка12 = ДокументыЗаПериод.ПереведеноВДругиеОтделения;
		СтрокаПрофиля.Колонка13 = ДокументыЗаПериод.Выписано;
		СтрокаПрофиля.Колонка14 = ДокументыЗаПериод.ВыписаноСтаршеТрудоспособногоВозраста;
		СтрокаПрофиля.Колонка15 = ДокументыЗаПериод.ВыписаноВДневнойСтационар;
		СтрокаПрофиля.Колонка16 = ДокументыЗаПериод.ВыписаноВКруглосуточныйСтационар;
		СтрокаПрофиля.Колонка17 = ДокументыЗаПериод.Умерло;
		СтрокаПрофиля.Колонка18 = ДокументыЗаПериод.УмерлоНесовершеннолетних;
		СтрокаПрофиля.Колонка19 = ДокументыЗаПериод.УмерлоСтаршеТрудоспособногоВозраста;
		СтрокаПрофиля.Колонка23 = ДокументыЗаПериод.ЧислоНедоступныхКоек; 
		СтрокаПрофиля.Колонка24 = ДокументыЗаПериод.ЗаконныхПредставителейНаКонецПериода;		
		СтрокаПрофиля.Колонка21 = ДокументыЗаПериод.КойкоДней;							
		СтрокаПрофиля.Колонка22 = ДокументыЗаПериод.КойкоДнейСтаршеТрудоспособногоВозраста;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьДокументыНаКаждуюДатуПериода(Даты, Подразделение, НачалоПериода, КонецПериода)
	
	ВсегоДней = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / (60 * 60 * 24) + 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеМедицинскихОтчетов007у.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ДанныеМедицинскихОтчетов007у КАК ДанныеМедицинскихОтчетов007у
	               |ГДЕ
	               |	ДанныеМедицинскихОтчетов007у.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ДанныеМедицинскихОтчетов007у.Подразделение = &Подразделение
				   |	И ДанныеМедицинскихОтчетов007у.Активность";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Даты = Запрос.Выполнить().Выбрать();
	
	Возврат ВсегоДней = Даты.Количество();
	
КонецФункции

Функция ПолучитьОтсутствующиеДаты(Даты, НачалоПериода, КонецПериода)
	
	Период = НачалоПериода;
	
	Массив = Новый Массив;
	Пока Период < КонецПериода Цикл
		Массив.Добавить(Период);
		Период = Период + 86400;
	КонецЦикла;
	
	Пока Даты.Следующий() Цикл
		Период = Массив.Найти(Даты.Период);
		Если Период <> Неопределено Тогда
			Массив.Удалить(Период);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция СообщениеОбОтстутствующихДанных(Даты)
	
	Сообщение = "Отсутствуют данные для заполнения на следующие даты:";
	
	ВсегоДат = Даты.Количество();
	Ограничение = ОграничениеНаВыводДат();
	
	МаксСч = ?(ВсегоДат <= Ограничение, ВсегоДат - 1, Ограничение);
	
	Сообщение = Сообщение + " " + Формат(Даты[0],"ДФ=dd.MM.yyyy");
	
	Для Сч = 1 По МаксСч Цикл
		Сообщение = Сообщение + ", " + Формат(Даты[Сч],"ДФ=dd.MM.yyyy");		
	КонецЦикла;
	
	Сообщение = Сообщение + ".";
	
	Если МаксСч = Ограничение Тогда
		Сообщение = Сообщение + ".." + Символы.ПС + "Ещё " + Строка(ВсегоДат - Ограничение) + ".";		
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти

#Область Константы

Функция ОграничениеНаВыводДат()
	
	Возврат 35;
	
КонецФункции

#КонецОбласти

#КонецОбласти

мВерсияОтчета = "1.0";
